app/controllers/artists_controller.rb

  def show
  	@albums  = Album.where("artists_id = ?", params[:id])
---
SELECT "albums".* FROM "albums" WHERE (artists_id = '1')